Finding Missing Data

In [1]:
import numpy as np
import pandas as pd

In [3]:
data = {
    'a' : [1, 2, np.nan],
    'b' : [4, np.nan, 6],  
    'c' : [7, 8, 9],
    'd' : [np.nan, 11, 12]
}
df = pd.DataFrame(data)
df

     a    b  c     d
0  1.0  4.0  7   NaN
1  2.0  NaN  8  11.0
2  NaN  6.0  9  12.0

In [ ]:
# Check for missing values
df.isna()

       a      b      c      d
0  False  False  False   True
1  False   True  False  False
2   True  False  False  False

In [ ]:
# Count of missing values in each column
df.isna().sum()

a    1
b    1
c    0
d    1
dtype: int64

In [ ]:
# Check if any column has missing values
df.isna().any

<bound method DataFrame.any of        a      b      c      d
0  False  False  False   True
1  False   True  False  False
2   True  False  False  False>

In [ ]:
# Alternative method to check for missing values
df.isnull()

       a      b      c      d
0  False  False  False   True
1  False   True  False  False
2   True  False  False  False

Removing Missing data

In [11]:
data = {
    'a' : [1, 2, np.nan],
    'b' : [4, 8, 6],  
    'c' : [7, 8, 9],
    'd' : [np.nan, 11, 12]
}
df = pd.DataFrame(data)
df

     a  b  c     d
0  1.0  4  7   NaN
1  2.0  8  8  11.0
2  NaN  6  9  12.0

In [12]:
# Drop rows with missing values
df.dropna()

     a  b  c     d
1  2.0  8  8  11.0

In [13]:
df

     a  b  c     d
0  1.0  4  7   NaN
1  2.0  8  8  11.0
2  NaN  6  9  12.0

In [ ]:
# Drop rows with at least 4 non-NA values
df.dropna(thresh=4)

     a  b  c     d
1  2.0  8  8  11.0

Filling the missing data

In [18]:
df

     a  b  c     d
0  1.0  4  7   NaN
1  2.0  8  8  11.0
2  NaN  6  9  12.0

In [ ]:
# Fill missing values with 0
df.fillna(0)

     a  b  c     d
0  1.0  4  7   0.0
1  2.0  8  8  11.0
2  0.0  6  9  12.0

In [ ]:
df
#nothing update, for update the data fram use inplace = True
#df.fillna(0, inplace=True)

     a  b  c     d
0  1.0  4  7   NaN
1  2.0  8  8  11.0
2  NaN  6  9  12.0

In [ ]:
# Fill missing values with different values for each column
values = { 'a': 10, 'b': 20, 'c': 30, 'd': 40 }
df.fillna(value=values)

      a  b  c     d
0   1.0  4  7  40.0
1   2.0  8  8  11.0
2  10.0  6  9  12.0

In [ ]:
# Fill missing values with the mean of each column
df.fillna(df.mean())

     a  b  c     d
0  1.0  4  7  11.5
1  2.0  8  8  11.0
2  1.5  6  9  12.0

In [23]:
#fill missing values with the median of each column
df.fillna(df.median())

     a  b  c     d
0  1.0  4  7  11.5
1  2.0  8  8  11.0
2  1.5  6  9  12.0